# Introduction to Pandas

[![](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/drive/1FpWjpPEvJgCfo3XmkY-NPfRSNcmjDHrn?usp=sharing)

In [1]:
import pandas as pd

## 1. Read data

In [2]:
# show read big dataset

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/cstorm125/viztech/master/data/taladrod.csv')

In [4]:
df.head()

        id   brand  series  ... subscribers scraped_date  removed_date
0  2210000   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
1  2210001  TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2  2210009   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
3  2210012    FORD  RANGER  ...       760.0   2019-05-22           NaN
4  2210016  TOYOTA  SOLUNA  ...       699.0   2019-05-22           NaN

[5 rows x 17 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14037 entries, 0 to 14036
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                14037 non-null  int64
 1   brand             14037 non-null  object
 2   series            14037 non-null  object
 3   model             14037 non-null  object
 4   gen               14037 non-null  object
 5   year              14037 non-null  float64
 6   color             14037 non-null  object
 7   gear              14037 non-null  object
 8   gas               891 non-null    object
 9   sales_price       14037 non-null  object
 10  original_price    121 non-null    object
 11  market_price      6153 non-null   object
 12  description       14037 non-null  object
 13  contact_location  14037 non-null  object
 14  subscribers       14028 non-null  float64
 15  scraped_date      14037 non-null  object
 16  removed_date      1590 non-null   object
dtypes: float64(2), int64(1), object(14)
memory usage: 1.8+ MB

## 2. Series

In [6]:
ser = df['sales_price']
ser

0          488,000
1        1,677,000
2          338,000
3          689,000
4          359,000
           ...
14032      428,000
14033      530,000
14034      435,000
14035      168,000
14036      976,000
Name: sales_price, Length: 14037, dtype: object

In [7]:
ser.shape

(14037,)

## 3. Dataframe

In [8]:
df.tail()

            id   brand series  ... subscribers scraped_date  removed_date
14032  2232877   HONDA  CIVIC  ...      1614.0   2019-05-28           NaN
14033  2232878  TOYOTA  CAMRY  ...      1469.0   2019-05-28           NaN
14034  2232879  TOYOTA  CAMRY  ...      1469.0   2019-05-28           NaN
14035  2232880   HONDA   JAZZ  ...       825.0   2019-05-28           NaN
14036  2232881   HONDA  CIVIC  ...      1147.0   2019-05-28           NaN

[5 rows x 17 columns]

In [9]:
df.shape

(14037, 17)

## 4. Indexing

Position

In [10]:
df.iloc[3]

id                                                            2210012
brand                                                            FORD
series                                                         RANGER
model                                   2.2 WILDTRAK DBL CAB HI-RIDER
gen                                                         DOUBLECAB
year                                                             2016
color                                                           สีขาว
gear                                                      เกียร์ออโต้
gas                                                               NaN
sales_price                                                   689,000
original_price                                                    NaN
market_price                                                  849,000
description         รับรองสภาพ ไม่มีชน มือเดียว พาช่างมาตรวจสภาพรถ...
contact_location                                             กรุงเทพฯ
subscribers                                                       760
scraped_date                                               2019-05-22
removed_date                                                      NaN
Name: 3, dtype: object

In [11]:
df.iloc[3:5, 0:2]

        id   brand
3  2210012    FORD
4  2210016  TOYOTA

In [12]:
df.iloc[[1, 2, 4], [0, 2]]

        id  series
1  2210001  ESTIMA
2  2210009    JAZZ
4  2210016  SOLUNA

In [13]:
df.iloc[1:3, :]

        id   brand  series  ... subscribers scraped_date  removed_date
1  2210001  TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2  2210009   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN

[2 rows x 17 columns]

In [14]:
df.iloc[:, 1:3]

        brand  series
0       HONDA    JAZZ
1      TOYOTA  ESTIMA
2       HONDA    JAZZ
3        FORD  RANGER
4      TOYOTA  SOLUNA
...       ...     ...
14032   HONDA   CIVIC
14033  TOYOTA   CAMRY
14034  TOYOTA   CAMRY
14035   HONDA    JAZZ
14036   HONDA   CIVIC

[14037 rows x 2 columns]

In [15]:
df.iloc[1, 1]

'TOYOTA'

In [16]:
df.iat[1, 1]

'TOYOTA'

Label

In [17]:
df.loc[0]

id                                                            2210000
brand                                                           HONDA
series                                                           JAZZ
model                                              1.5 i-VTEC SV (AS)
gen                                                           ปี08-13
year                                                             2014
color                                                           สีขาว
gear                                                      เกียร์ออโต้
gas                                                               NaN
sales_price                                                   488,000
original_price                                                    NaN
market_price                                                      NaN
description         เครดิตดีออกรถ10,000จบครับ\nรับประกันเครื่องเกี...
contact_location                                             กรุงเทพฯ
subscribers                                                      1047
scraped_date                                               2019-05-22
removed_date                                                      NaN
Name: 0, dtype: object

In [18]:
df.loc[0, "brand"]

'HONDA'

In [19]:
df.loc[[0, 1], "brand"]

0     HONDA
1    TOYOTA
Name: brand, dtype: object

In [20]:
df.loc[[0, 5], "brand"]

0         HONDA
5    VOLKSWAGEN
Name: brand, dtype: object

In [21]:
df.loc[[0, 1], ["brand", "series"]]

    brand  series
0   HONDA    JAZZ
1  TOYOTA  ESTIMA

## 5. Slicing

In [22]:
df.loc[0:5]

        id       brand  series  ... subscribers scraped_date  removed_date
0  2210000       HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
1  2210001      TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2  2210009       HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
3  2210012        FORD  RANGER  ...       760.0   2019-05-22           NaN
4  2210016      TOYOTA  SOLUNA  ...       699.0   2019-05-22           NaN
5  2210017  VOLKSWAGEN    GOLF  ...        57.0   2019-05-22           NaN

[6 rows x 17 columns]

In [23]:
df.loc[0:5, ['model']]

                           model
0             1.5 i-VTEC SV (AS)
1                   2.4 G HYBRID
2              1.5 i-VTEC V (AS)
3  2.2 WILDTRAK DBL CAB HI-RIDER
4            VIOS 1.5 E (ABS+AB)
5                        2.0 GTI

In [24]:
df.loc[0:5, 'brand':'model']

        brand  series                          model
0       HONDA    JAZZ             1.5 i-VTEC SV (AS)
1      TOYOTA  ESTIMA                   2.4 G HYBRID
2       HONDA    JAZZ              1.5 i-VTEC V (AS)
3        FORD  RANGER  2.2 WILDTRAK DBL CAB HI-RIDER
4      TOYOTA  SOLUNA            VIOS 1.5 E (ABS+AB)
5  VOLKSWAGEN    GOLF                        2.0 GTI

In [63]:
df.iloc[0:5, 'brand':'model']

TypeError: ignored

In [26]:
df.iloc[0:5, 1:4]

    brand  series                          model
0   HONDA    JAZZ             1.5 i-VTEC SV (AS)
1  TOYOTA  ESTIMA                   2.4 G HYBRID
2   HONDA    JAZZ              1.5 i-VTEC V (AS)
3    FORD  RANGER  2.2 WILDTRAK DBL CAB HI-RIDER
4  TOYOTA  SOLUNA            VIOS 1.5 E (ABS+AB)

## 6. Aggregation

In [67]:
df2 = df[['sales_price', 'brand', 'market_price']]
df2.sample(n=5)

      sales_price   brand market_price
11574     579,000   ISUZU          NaN
5254      559,000   ISUZU          NaN
11230     169,000  TOYOTA          NaN
12925     319,000  TOYOTA      589,000
290       698,000   HONDA    1,445,000

In [68]:
df2.dtypes

sales_price     object
brand           object
market_price    object
dtype: object

In [69]:
df2['sales_price'].astype(int)

ValueError: ignored

In [70]:
df2['sales_price'] = df2['sales_price'].str.replace(',', '')
df2['sales_price'] = df2['sales_price'].astype(int)
print(df2.dtypes)
df2.head()

sales_price      int64
brand           object
market_price    object
dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   sales_price   brand market_price
0       488000   HONDA          NaN
1      1677000  TOYOTA    3,050,000
2       338000   HONDA          NaN
3       689000    FORD      849,000
4       359000  TOYOTA      649,000

In [71]:
print(f"Lowest sales price: {df2['sales_price'].min()}")
print(f"Highest sales price: {df2['sales_price'].max()}")
print(f"Average sales price: {df2['sales_price'].mean()}")
print(f"Median sales price: {df2['sales_price'].median()}")

Lowest sales price: 20000
Highest sales price: 55000000
Average sales price: 606793.1894279404
Median sales price: 413000.0

In [72]:
df2['sales_price'].describe()

count    1.403700e+04
mean     6.067932e+05
std      8.720579e+05
min      2.000000e+04
25%      2.790000e+05
50%      4.130000e+05
75%      6.480000e+05
max      5.500000e+07
Name: sales_price, dtype: float64

In [73]:
df2['brand']

0         HONDA
1        TOYOTA
2         HONDA
3          FORD
4        TOYOTA
          ...
14032     HONDA
14033    TOYOTA
14034    TOYOTA
14035     HONDA
14036     HONDA
Name: brand, Length: 14037, dtype: object

In [74]:
df2['brand'].unique()

array(['HONDA', 'TOYOTA', 'FORD', 'VOLKSWAGEN', 'CHEVROLET', 'VOLVO',
       'AUDI', 'ISUZU', 'NISSAN', 'BMW', 'BENZ', 'SUZUKI', 'LEXUS',
       'PORSCHE', 'SUBARU', 'MITSUBISHI', 'MAZDA', 'MG', 'SAAB',
       'LANDROVER', 'PEUGEOT', 'JAGUAR', 'MINI', 'HYUNDAI', 'THAI RUNG',
       'PROTON', 'KIA', 'HINO', 'TATA', 'FIAT', 'JEEP', 'SEAT',
       'LAMBORGHINI', 'SKODA', 'ROVER', 'SSANGYONG', 'MASERATI',
       'DAIHATSU', 'CITROEN', 'DFSK', 'FERRARI', 'ASTON MARTIN',
       'BENTLEY', 'ALFA ROMEO', 'LOTUS', 'FOTON', 'HUMMER', 'CHERY',
       'MITSUOKA'], dtype=object)

In [75]:
df2['brand'].nunique()

49

In [76]:
df2['brand'].value_counts().head()

TOYOTA    4227
HONDA     2252
NISSAN    1055
ISUZU     1050
BENZ      1036
Name: brand, dtype: int64

In [77]:
df2.groupby(['brand'])['sales_price'].max().head()

brand
ALFA ROMEO        455000
ASTON MARTIN     6900000
AUDI             8390000
BENTLEY         13800000
BENZ            12800000
Name: sales_price, dtype: int64

In [78]:
df2.groupby(['brand'])['sales_price'].min().head()

brand
ALFA ROMEO       256000
ASTON MARTIN    6900000
AUDI              88000
BENTLEY         5800000
BENZ              28000
Name: sales_price, dtype: int64

In [79]:
df2.groupby(['brand'])['sales_price'].mean().head()

brand
ALFA ROMEO      3.555000e+05
ASTON MARTIN    6.900000e+06
AUDI            1.594739e+06
BENTLEY         9.100000e+06
BENZ            1.295657e+06
Name: sales_price, dtype: float64

In [80]:
price_max = df2.groupby(['brand'])['sales_price'].max()
print(type(price_max))
print(price_max.shape)
price_max.head()

<class 'pandas.core.series.Series'>
(49,)

brand
ALFA ROMEO        455000
ASTON MARTIN     6900000
AUDI             8390000
BENTLEY         13800000
BENZ            12800000
Name: sales_price, dtype: int64

In [81]:
price_max = price_max.reset_index()
print(type(price_max))
print(price_max.shape)
price_max.head()

<class 'pandas.core.frame.DataFrame'>
(49, 2)

          brand  sales_price
0    ALFA ROMEO       455000
1  ASTON MARTIN      6900000
2          AUDI      8390000
3       BENTLEY     13800000
4          BENZ     12800000

In [82]:
price_max.sort_values(['sales_price']).head()

    brand  sales_price
40  SKODA        89000
10   DFSK        89000
39   SEAT       135000
6   CHERY       139000
38   SAAB       245000

In [83]:
price_max.sort_values(['sales_price'], ascending=False).head()

      brand  sales_price
35  PORSCHE     55000000
11  FERRARI     22000000
3   BENTLEY     13800000
4      BENZ     12800000
46   TOYOTA     11900000

In [86]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14037 entries, 0 to 14036
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sales_price   14037 non-null  int64
 1   brand         14037 non-null  object
 2   market_price  6153 non-null   object
dtypes: int64(1), object(2)
memory usage: 329.1+ KB

In [102]:
price_df = df2[['sales_price', 'market_price']].dropna()
price_df

       sales_price market_price
1          1677000    3,050,000
3           689000      849,000
4           359000      649,000
6           459000      829,000
10          388000      699,000
...            ...          ...
14022       389000      682,000
14023       899000    1,541,000
14030      2590000    6,650,000
14033       530000    1,299,000
14036       976000    1,190,000

[6153 rows x 2 columns]

In [103]:
price_df.reset_index()

      index  sales_price market_price
0         1      1677000    3,050,000
1         3       689000      849,000
2         4       359000      649,000
3         6       459000      829,000
4        10       388000      699,000
...     ...          ...          ...
6148  14022       389000      682,000
6149  14023       899000    1,541,000
6150  14030      2590000    6,650,000
6151  14033       530000    1,299,000
6152  14036       976000    1,190,000

[6153 rows x 3 columns]

In [104]:
price_df = price_df.reset_index(drop=True)
price_df

      sales_price market_price
0         1677000    3,050,000
1          689000      849,000
2          359000      649,000
3          459000      829,000
4          388000      699,000
...           ...          ...
6148       389000      682,000
6149       899000    1,541,000
6150      2590000    6,650,000
6151       530000    1,299,000
6152       976000    1,190,000

[6153 rows x 2 columns]

In [105]:
price_df['market_price'] = price_df['market_price'].str.replace(',', '').astype(int)
print(price_df.dtypes)
price_df.head()

sales_price     int64
market_price    int64
dtype: object

   sales_price  market_price
0      1677000       3050000
1       689000        849000
2       359000        649000
3       459000        829000
4       388000        699000

In [106]:
def thb_to_usd(thb):
  usd = thb / 30
  return usd

In [107]:
price_df['sales_price'].map(thb_to_usd)

0       55900.000000
1       22966.666667
2       11966.666667
3       15300.000000
4       12933.333333
            ...
6148    12966.666667
6149    29966.666667
6150    86333.333333
6151    17666.666667
6152    32533.333333
Name: sales_price, Length: 6153, dtype: float64

In [108]:
price_df['market_price'].map(thb_to_usd)

0       101666.666667
1        28300.000000
2        21633.333333
3        27633.333333
4        23300.000000
            ...
6148     22733.333333
6149     51366.666667
6150    221666.666667
6151     43300.000000
6152     39666.666667
Name: market_price, Length: 6153, dtype: float64

In [109]:
price_df.map(thb_to_usd)

AttributeError: ignored

In [110]:
price_df.apply(thb_to_usd)

       sales_price   market_price
0     55900.000000  101666.666667
1     22966.666667   28300.000000
2     11966.666667   21633.333333
3     15300.000000   27633.333333
4     12933.333333   23300.000000
...            ...            ...
6148  12966.666667   22733.333333
6149  29966.666667   51366.666667
6150  86333.333333  221666.666667
6151  17666.666667   43300.000000
6152  32533.333333   39666.666667

[6153 rows x 2 columns]

In [112]:
price_df.apply(lambda x: x['market_price'] - x['sales_price'], axis=1)

0       1373000
1        160000
2        290000
3        370000
4        311000
         ...
6148     293000
6149     642000
6150    4060000
6151     769000
6152     214000
Length: 6153, dtype: int64

## 7. Analyze data

In [ ]:
iris = pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [ ]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

Question:
1. ค่าเฉลี่ยของความยาวและความกว้างของกลีบเลี้ยงคือเท่าไหร่ ?
2. กลีบดอกมีความยาวและความกว้่างมากที่สุดเท่าไหร่ ?
3. ดอกไม้ species ไหน มีจำนวนเยอะที่สุด ?
4. แต่ละ species มีค่าเฉลี่ยความยาวและความกว้างของกลีบเลี้ยงคือเท่าไหร่ ?